<p> Математические операции
<p>Первое выражение
<p>
<?php
$c=rand(-20,20);
$d=rand(-20,20);
$a=rand(-20,20);
if ($c+$a-1==0){
$result = 'На ноль делить нельзя';
}
else {
	$result = (((2*$c)-(42*$d))/($c+$a-1));
}
print ((((('2'.'*'.$c)).'-'.('42'.'*'.$d)).'/'.($c.'+'.$a.'-'.'1')).'='.$result);
?>
<p> Второе выражение
<p>
<?php
$c=rand(-20,20);
$d=rand(-20,20);
$a=rand(-20,20);
if ($d==0 or ($d-pow($a,2)-1)==0){
	$result = 'На ноль делить нельзя';
}
else {
	$result = (((2*$c)/$d)+2)/($d-pow($a,2)-1);
}
printf ((((('2'.'*'.$c).'/'.$d).'+'.'2').'/'.($d.'-'.$a.'^2'.'-'.'1')).'='.$result);
?>
